In [1]:
import pandas as pd
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

In [2]:
import os
print(os.getcwd())  # Esto imprime el directorio actual

c:\Users\rey_d\Documents\GitHub\An-lisis-de-inversion-inmobiliario\notebooks

In [3]:
import os

# Cambiar el directorio de trabajo al nivel superior
os.chdir('..')

# Verificar dónde estás ahora
print("Directorio actual:", os.getcwd())

Directorio actual: c:\Users\rey_d\Documents\GitHub\An-lisis-de-inversion-inmobiliario

In [4]:
df = pd.read_csv(r'data\precioViviendaValencia.csv', sep=';')

In [5]:
#añadimos columna city
df['city'] = 'Valencia'

In [6]:
df.head()

    Año      Periodo Precio Valencia Precio España      city
0  2007  Trimestre 1         1.988,7           NaN  Valencia
1  2007  Trimestre 2        2.077,27           NaN  Valencia
2  2007  Trimestre 3         2.198,5           NaN  Valencia
3  2007  Trimestre 4        2.296,58           NaN  Valencia
4  2008  Trimestre 1        2.386,34           NaN  Valencia

In [7]:
df.columns

Index(['Año', 'Periodo', 'Precio Valencia', 'Precio España', 'city'], dtype='object')

In [8]:
# lo primero que podemos comprobar es el tipo de dato de cada columna
df.dtypes

Año                 int64
Periodo            object
Precio Valencia    object
Precio España      object
city               object
dtype: object

In [9]:
#Convertir la columna a tipo numérico Valencia

# 1. Asegúrate de que es string (por si hay números ya)
df['Precio Valencia'] = df['Precio Valencia'].astype(str)

# 2. Elimina los puntos de miles y reemplaza la coma decimal por punto
df['Precio Valencia'] = df['Precio Valencia'].str.replace('.', '', regex=False)  # quita miles
df['Precio Valencia'] = df['Precio Valencia'].str.replace(',', '.', regex=False)  # cambia decimal

# 3. Convierte a número
df['Precio Valencia'] = pd.to_numeric(df['Precio Valencia'], errors='coerce')
# 4. Redondea a 2 decimales
df['Precio Valencia'] = df['Precio Valencia'].round(2)

In [10]:
#converttir la columno a tipo numerico españa
# 1. Asegúrate de que es string (por si hay números ya)
df['Precio España'] = df['Precio España'].astype(str)

# 2. Elimina los puntos de miles y reemplaza la coma decimal por punto
df['Precio España'] = df['Precio España'].str.replace('.', '', regex=False)  # quita miles
df['Precio España'] = df['Precio España'].str.replace(',', '.', regex=False)  # cambia decimal

# 3. Convierte a número
df['Precio España'] = pd.to_numeric(df['Precio España'], errors='coerce')
# 4. Redondea a 2 decimales
df['Precio España'] = df['Precio España'].round(2)

In [11]:
df.duplicated().sum()  # Comprobamos si hay filas duplicadas

np.int64(0)

In [12]:
df.isnull().sum()  # Comprobamos si hay valores nulos en cada columna

Año                  0
Periodo              0
Precio Valencia    219
Precio España       47
city                 0
dtype: int64

In [13]:
df.isnull().sum() / 100  # Porcentaje de valores nulos en cada columna

Año                0.00
Periodo            0.00
Precio Valencia    2.19
Precio España      0.47
city               0.00
dtype: float64

In [14]:
# Función para rellenar valores nulos con la media de valencia por año

# Rellenar nulos con la media por año
df['Precio Valencia'] = df.groupby('Año')['Precio Valencia'].transform(lambda x: x.fillna(x.mean()))

# Rellenar los que queden nulos con la media global (o un valor fijo)
media_global = df['Precio Valencia'].mean()
df['Precio Valencia'].fillna(media_global, inplace=True)

In [15]:
# Función para rellenar valores nulos con la media de España por año
# Rellenar nulos con la media por año
df['Precio España'] = df.groupby('Año')['Precio España'].transform(lambda x: x.fillna(x.mean()))

# Rellenar los que queden nulos con la media global (o un valor fijo)
media_global = df['Precio España'].mean()
df['Precio España'].fillna(media_global, inplace=True)

In [16]:
df.isnull().sum()  # Comprobamos si hay valores nulos en cada columna

Año                0
Periodo            0
Precio Valencia    0
Precio España      0
city               0
dtype: int64

In [21]:
df.head()

    Año      Periodo  Precio Valencia  Precio España      city
0  2007  Trimestre 1          1988.70      1790.0700  Valencia
1  2007  Trimestre 2          2077.27      1790.0700  Valencia
2  2007  Trimestre 3          2198.50      1790.0700  Valencia
3  2007  Trimestre 4          2296.58      1790.0700  Valencia
4  2008  Trimestre 1          2386.34      1758.5425  Valencia

In [18]:
df_limpio_valencia_vivienda = df.copy()

In [19]:
#guardamos
df_limpio_valencia_vivienda.to_csv(r"data\valencia_vivienda_limpio.csv", index=False)